Revit 2026 API
Rebar.CreateFromCurvesAndShape Method
Overload List
Name | Description
CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, Element, XYZ, IList<Curve>, BarTerminationsData)
CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation) | Obsolete.
CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId) | Obsolete.
Top
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace